DeqingSun/arduino_core_ch32/libraries/CH573BlePeripheral/src/CH573BleTmos.cpp
#include "CH573BleTmos.h"

#include "CONFIG.h"
#include "devinfoservice.h"

#include "BLEUuid.h"

#include "HAL.h"
#include "peripheral.h"

/*********************************************************************
 * LOCAL FUNCTIONS
 */
bStatus_t ch573BleTmosProfile_ReadAttrCB(uint16_t connHandle, gattAttribute_t *pAttr,
                                          uint8_t *pValue, uint16_t *pLen, uint16_t offset, uint16_t maxLen, uint8_t method);
bStatus_t ch573BleTmosProfile_WriteAttrCB(uint16_t connHandle, gattAttribute_t *pAttr,
                                           uint8_t *pValue, uint16_t len, uint16_t offset, uint8_t method);

/*********************************************************************
 * PROFILE CALLBACKS
 */
// Simple Profile Service Callbacks
gattServiceCBs_t ch573BleTmosProfileCBs = {
    ch573BleTmosProfile_ReadAttrCB,  // Read callback function pointer
    ch573BleTmosProfile_WriteAttrCB, // Write callback function pointer
    NULL                       // Authorization callback function pointer
};

CH573BleTmos *ch573TmosInstance = NULL;
struct ProfileAttrTableFastLutEntry* profileAttrTableFastLut;
int profileAttrTableFastLutLength;
struct NotificationConfigEntry* notificationConfigTable;
int notificationConfigTableLength;


/*********************************************************************
 * @fn          simpleProfile_ReadAttrCB
 *
 * @brief       Read an attribute.
 *
 * @param       connHandle - connection message was received on
 * @param       pAttr - pointer to attribute
 * @param       pValue - pointer to data to be read
 * @param       pLen - length of data to be read
 * @param       offset - offset of the first octet to be read
 * @param       maxLen - maximum length of data to be read
 *
 * @return      Success or Failure
 */
bStatus_t ch573BleTmosProfile_ReadAttrCB(uint16_t connHandle, gattAttribute_t *pAttr,
                                          uint8_t *pValue, uint16_t *pLen, uint16_t offset, uint16_t maxLen, uint8_t method)
{
    bStatus_t status = SUCCESS;

    // Make sure it's not a blob operation (no attributes in the profile are long)
    if(offset > 0)
    {
        return (ATT_ERR_ATTR_NOT_LONG);
    }

    //check permission from pAttr
    if (pAttr->permissions & GATT_PERMIT_READ) {
        int i;
        for (i = 0; i < profileAttrTableFastLutLength; i++) {
            if (profileAttrTableFastLut[i].profileAttrPtr == pAttr) {
                if (profileAttrTableFastLut[i].profileAttrValueLen > maxLen) {
                    *pLen = maxLen;
                } else {
                    *pLen = profileAttrTableFastLut[i].profileAttrValueLen;
                }
                tmos_memcpy(pValue, pAttr->pValue, *pLen);
                break;
            }
        }
        if (i == profileAttrTableFastLutLength) {
            *pLen = 0;
            status = ATT_ERR_ATTR_NOT_FOUND;
        }
    } else {
        *pLen = 0;
        return (ATT_ERR_READ_NOT_PERMITTED);
    }

    return (status);
}

/*********************************************************************
 * @fn      simpleProfile_WriteAttrCB
 *
 * @brief   Validate attribute data prior to a write operation
 *
 * @param   connHandle - connection message was received on
 * @param   pAttr - pointer to attribute
 * @param   pValue - pointer to data to be written
 * @param   len - length of data
 * @param   offset - offset of the first octet to be written
 *
 * @return  Success or Failure
 */
bStatus_t ch573BleTmosProfile_WriteAttrCB(uint16_t connHandle, gattAttribute_t *pAttr,
                                           uint8_t *pValue, uint16_t len, uint16_t offset, uint8_t method)
{
    bStatus_t status = SUCCESS;
    uint8_t   notifyApp = 0xFF;

    // If attribute permissions require authorization to write, return error
    if(gattPermitAuthorWrite(pAttr->permissions))
    {
        // Insufficient authorization
        return (ATT_ERR_INSUFFICIENT_AUTHOR);
    }

    //check permission from pAttr
    if (pAttr->permissions & GATT_PERMIT_WRITE) {
        if ((pAttr->type.len == ATT_BT_UUID_SIZE) && (pAttr->type.uuid[0]==LO_UINT16(GATT_CLIENT_CHAR_CFG_UUID)) && (pAttr->type.uuid[1]==HI_UINT16(GATT_CLIENT_CHAR_CFG_UUID))) {
            status = GATTServApp_ProcessCCCWriteReq(connHandle, pAttr, pValue, len, offset, GATT_CLIENT_CFG_NOTIFY);
        } else{
            int i;
            for (i = 0; i < profileAttrTableFastLutLength; i++) {
                if (profileAttrTableFastLut[i].profileAttrPtr == pAttr) {
                    //Validate the value
                    // Make sure it's not a blob oper
                    if(offset == 0)
                    {
                        if(len > profileAttrTableFastLut[i].profileAttrValueLen)
                        {
                            status = ATT_ERR_INVALID_VALUE_SIZE;
                        }
                    }
                    else
                    {
                        status = ATT_ERR_ATTR_NOT_LONG;
                    }

                    //Write the value
                    if(status == SUCCESS)
                    {
                        tmos_memcpy(pAttr->pValue, pValue, profileAttrTableFastLut[i].profileAttrValueLen);
                        //change to BLEDeviceCharacteristicValueChanged!!!!!!!!!!!
                        //https://github.com/sandeepmistry/arduino-BLEPeripheral/blob/master/src/nRF51822.cpp
                        //notifyApp = SIMPLEPROFILE_CHAR1;
                    }
                    break;
                }
            }
            if (i == profileAttrTableFastLutLength) {
                status = ATT_ERR_ATTR_NOT_FOUND;
            }
        }
    } else {
        return (ATT_ERR_WRITE_NOT_PERMITTED);
    }

    // // If a charactersitic value changed then callback function to notify application of change
    // if((notifyApp != 0xFF) && simpleProfile_AppCBs && simpleProfile_AppCBs->pfnSimpleProfileChange)
    // {
    //     simpleProfile_AppCBs->pfnSimpleProfileChange(notifyApp, pValue, len);
    // }
    // In this code, we do not really use simpleProfile_AppCBs, just callback in our own way when needed

    return (status);
}

void ch573BleTmosProfile_HandleConnStatusCB(uint16_t connHandle, uint8_t changeType){
    // Make sure this is not loopback connection
    if(connHandle != LOOPBACK_CONNHANDLE)
    {
        // Reset Client Char Config if connection has dropped
        if((changeType == LINKDB_STATUS_UPDATE_REMOVED) ||
           ((changeType == LINKDB_STATUS_UPDATE_STATEFLAGS) &&
            (!linkDB_Up(connHandle))))
        {
            for (int i = 0; i < notificationConfigTableLength; i++) {
                GATTServApp_InitCharCfg(connHandle, notificationConfigTable[i].charConfig);
            }
        }
    }
}

