DeqingSun/arduino_core_ch32/libraries/CH573BlePeripheral/src/CH573BleTmos.cpp
static uint8_t attDeviceName[GAP_DEVICE_NAME_LEN] = "Simple Peripheral";

extern "C" void CH573BleTmosConnectedCallback(gapEstLinkReqEvent_t *pEvent);
extern "C" void CH573BleTmosDisconnectedCallback(gapTerminateLinkEvent_t *pEvent);

void CH573BleTmosConnectedCallback(gapEstLinkReqEvent_t *pEvent) {
    if (ch573TmosInstance) {
        ch573TmosInstance->bleConnectedCallback(pEvent);
    }
}

void CH573BleTmosDisconnectedCallback(gapTerminateLinkEvent_t *pEvent) {
    if (ch573TmosInstance) {
        ch573TmosInstance->bleDisconnectedCallback(pEvent);
    }
}


CH573BleTmos::CH573BleTmos() :
  BLEDevice(),

  advertDataLen(0),
  scanRspDataLen(0)

  //_hasScanData(false)//,
//   _broadcastCharacteristic(NULL),

//   _connectionHandle(BLE_CONN_HANDLE_INVALID),

//   _txBufferCount(0),

//   _numLocalCharacteristics(0),
//   _localCharacteristicInfo(NULL),

//   _numRemoteServices(0),
//   _remoteServiceInfo(NULL),
//   _remoteServiceDiscoveryIndex(0),
//   _numRemoteCharacteristics(0),
//   _remoteCharacteristicInfo(NULL),
//   _remoteRequestInProgress(false)
{
// #if defined(NRF5) || defined(NRF51_S130)
//   this->_encKey = (ble_gap_enc_key_t*)&this->_bondData;
//   memset(&this->_bondData, 0, sizeof(this->_bondData));
// #else
//   this->_authStatus = (ble_gap_evt_auth_status_t*)&this->_authStatusBuffer;
//   memset(&this->_authStatusBuffer, 0, sizeof(this->_authStatusBuffer));
// #endif
    ch573TmosInstance = this;
    profileAttrTableFastLutLength = 0;
    notificationConfigTableLength = 0;
}

CH573BleTmos::~CH573BleTmos() {
  //this->end();
}

void CH573BleTmos::begin(unsigned char _advertisementDataSize,
                      BLEEirData *_advertisementData,
                      unsigned char _scanDataSize,
                      BLEEirData *_scanData,
                      BLELocalAttribute** _localAttributes,
                      unsigned char _numLocalAttributes,
                      BLERemoteAttribute** _remoteAttributes,
                      unsigned char _numRemoteAttributes)
{

     // Initialize the BLE stack
    CH57X_BLEInit();
    // Initialize the hardware abstraction layer
    HAL_Init(); //halTaskID = 2
    // Initialize the GAP role
    // The function is inside the BLE stack binary library
    GAPRole_PeripheralInit();


    






    localAttributes = _localAttributes;
    numLocalAttributes = _numLocalAttributes;

    // prepare advertData
    // flags
    advertDataLen = 0;
    advertData[advertDataLen++] = 0x02; // length
    advertData[advertDataLen++] = GAP_ADTYPE_FLAGS;
    advertData[advertDataLen++] = DEFAULT_DISCOVERABLE_MODE | GAP_ADTYPE_FLAGS_BREDR_NOT_SUPPORTED;

    if (_advertisementDataSize && _advertisementData) {
        for (int i = 0; i < _advertisementDataSize; i++) {
            advertData[advertDataLen + 0] = _advertisementData[i].length + 1;
            advertData[advertDataLen + 1] = _advertisementData[i].type;
            advertDataLen += 2;

            memcpy(&advertData[advertDataLen], _advertisementData[i].data, _advertisementData[i].length);

            advertDataLen += _advertisementData[i].length;
        }
    }


    // prepare scanRspData
    scanRspDataLen = 0;

    if (_scanDataSize && _scanData) {
        for (int i = 0; i < _scanDataSize; i++) {
            scanRspData[scanRspDataLen + 0] = _scanData[i].length + 1;
            scanRspData[scanRspDataLen + 1] = _scanData[i].type;
            scanRspDataLen += 2;

            memcpy(&scanRspData[scanRspDataLen], _scanData[i].data, _scanData[i].length);

            scanRspDataLen += _scanData[i].length;
            //_hasScanData = true;
        }
    }

        //// connection interval range?
        // Tx power level?

    uint8_t  initial_advertising_enable = TRUE;
    uint16_t desired_min_interval = DEFAULT_DESIRED_MIN_CONN_INTERVAL;
    uint16_t desired_max_interval = DEFAULT_DESIRED_MAX_CONN_INTERVAL;

    // Set the GAP Role Parameters
    GAPRole_SetParameter(GAPROLE_ADVERT_ENABLED, sizeof(uint8_t), &initial_advertising_enable);
    GAPRole_SetParameter(GAPROLE_SCAN_RSP_DATA, scanRspDataLen, scanRspData);
    GAPRole_SetParameter(GAPROLE_ADVERT_DATA, advertDataLen, advertData);
    GAPRole_SetParameter(GAPROLE_MIN_CONN_INTERVAL, sizeof(uint16_t), &desired_min_interval);
    GAPRole_SetParameter(GAPROLE_MAX_CONN_INTERVAL, sizeof(uint16_t), &desired_max_interval);

        // Set advertising interval
    {
        uint16_t advInt = DEFAULT_ADVERTISING_INTERVAL;

        GAP_SetParamValue(TGAP_DISC_ADV_INT_MIN, advInt);
        GAP_SetParamValue(TGAP_DISC_ADV_INT_MAX, advInt);
    }

    // Setup the GAP Bond Manager
    {
        uint32_t passkey = 0; // passkey "000000"
        uint8_t  pairMode = GAPBOND_PAIRING_MODE_WAIT_FOR_REQ;
        uint8_t  mitm = TRUE;
        uint8_t  bonding = TRUE;
        uint8_t  ioCap = GAPBOND_IO_CAP_DISPLAY_ONLY;
        GAPBondMgr_SetParameter(GAPBOND_PERI_DEFAULT_PASSCODE, sizeof(uint32_t), &passkey);
        GAPBondMgr_SetParameter(GAPBOND_PERI_PAIRING_MODE, sizeof(uint8_t), &pairMode);
        GAPBondMgr_SetParameter(GAPBOND_PERI_MITM_PROTECTION, sizeof(uint8_t), &mitm);
        GAPBondMgr_SetParameter(GAPBOND_PERI_IO_CAPABILITIES, sizeof(uint8_t), &ioCap);
        GAPBondMgr_SetParameter(GAPBOND_PERI_BONDING_ENABLED, sizeof(uint8_t), &bonding);
    }

    // Initialize GATT attributes
    GGS_AddService(GATT_ALL_SERVICES);           // GAP
    GATTServApp_AddService(GATT_ALL_SERVICES);   // GATT attributes
    DevInfo_AddService();                        // Device Information Service

    //deal with 1 service for now
    int numberOfCharacteristics = 0;
    int numberOfNotifyCharacteristics = 0;
    int uuidMallocLength = 0;
    for (int i = 0; i < numLocalAttributes; i++) {
        BLELocalAttribute* localAttribute = localAttributes[i];
        BLEUuid uuid = BLEUuid(localAttribute->uuid());
        if (localAttribute->type() == BLETypeCharacteristic) {
            BLECharacteristic* characteristic = (BLECharacteristic*)localAttribute;
            numberOfCharacteristics++;
            uuidMallocLength += (uuid.length()+3)&0xFC; // Upround to 4 bytes
            uuidMallocLength += (1+3)&0xFC;    // 1 byte for the properties
            if (characteristic->properties() & BLENotify) {
                numberOfNotifyCharacteristics++;
            }
        }
        if (localAttribute->type() == BLETypeService) {
            //BLEService* service = (BLEService*)localAttribute;
            uuidMallocLength += (uuid.length()+3)&0xFC; // Upround to 4 bytes
            uuidMallocLength += (sizeof(gattAttrType_t)+3)&0xFC; // Upround to 4 bytes
        }
        if (localAttribute->type() == BLETypeDescriptor) {
            //BLEDescriptor* descriptor = (BLEDescriptor*)localAttribute;
            //uuid is fixed
        }
    }
    profileAttrTblLength = numLocalAttributes + numberOfCharacteristics+numberOfNotifyCharacteristics;
    profileAttrTbl = (gattAttribute_t *)malloc(sizeof(gattAttribute_t) * profileAttrTblLength);
    uuidTable = (unsigned char *)malloc(uuidMallocLength);
    uuidTableLength = uuidMallocLength;
    profileAttrTableFastLutLength = numberOfCharacteristics;
    profileAttrTableFastLut = (struct ProfileAttrTableFastLutEntry *)malloc(sizeof(ProfileAttrTableFastLutEntry) * profileAttrTableFastLutLength);
    notificationConfigTableLength = numberOfNotifyCharacteristics;
    notificationConfigTable = (struct NotificationConfigEntry *)malloc(sizeof(NotificationConfigEntry) * notificationConfigTableLength);

    int profileAttrTblIndex = 0;
    int profileAttrTableFastLutIndex = 0;
    int notificationConfigTableIndex = 0;
    unsigned char* uuidTableWritePtr = uuidTable;

    for (int i = 0; i < numLocalAttributes; i++) {
        BLELocalAttribute* localAttribute = localAttributes[i];
        BLEUuid uuid = BLEUuid(localAttribute->uuid());
        if (localAttribute->type() == BLETypeCharacteristic) {
            BLECharacteristic* characteristic = (BLECharacteristic*)localAttribute;
            unsigned char *serviceCharacterUUID = (unsigned char *)uuidTableWritePtr;
            memcpy(serviceCharacterUUID, uuid.data(), uuid.length());
            uuidTableWritePtr += (uuid.length()+3)&0xFC; // Upround to 4 bytes
            unsigned char *charProperty = (unsigned char *)uuidTableWritePtr;
            *charProperty = characteristic->properties();
            uuidTableWritePtr += (1+3)&0xFC;
            unsigned char characteristicPermission = 0;
            if (characteristic->properties() & BLERead) {
                characteristicPermission |= GATT_PERMIT_READ;
            }
            if (characteristic->properties() & BLEWrite) {
                characteristicPermission |= GATT_PERMIT_WRITE;
            }
            if (characteristic->properties() & BLENotify) {
                //characteristicPermission |= GATT_PERMIT_READ; //seem read not really needed
            }
            //not do AUTHEN etc yet

            gattAttribute_t *profileAttrTblOneEntry = &profileAttrTbl[profileAttrTblIndex];

            profileAttrTblOneEntry->type.len = ATT_BT_UUID_SIZE;
            uint8_t *characterUUIDPtr = (uint8_t *)characterUUID;
            memcpy(&profileAttrTblOneEntry->type.uuid, &characterUUIDPtr, sizeof(const uint8_t *));
            profileAttrTblOneEntry->permissions = GATT_PERMIT_READ;
            ((unsigned char *)(&profileAttrTblOneEntry->handle))[0] = 0;
            ((unsigned char *)(&profileAttrTblOneEntry->handle))[1] = 0;
            memcpy(&profileAttrTblOneEntry->pValue, &charProperty, sizeof(uint8_t *));
            // {{ATT_BT_UUID_SIZE, characterUUID},
            // GATT_PERMIT_READ,
            // 0,
            // &simpleProfileChar1Props},

