DeqingSun/arduino_core_ch32/libraries/CH573BlePeripheral/src/CH573BleTmos.cpp
            profileAttrTblIndex++;

            profileAttrTblOneEntry = &profileAttrTbl[profileAttrTblIndex];

            profileAttrTblOneEntry->type.len = uuid.length();
            memcpy(&profileAttrTblOneEntry->type.uuid, &serviceCharacterUUID, sizeof(const uint8_t *));
            profileAttrTblOneEntry->permissions = characteristicPermission;
            ((unsigned char *)(&profileAttrTblOneEntry->handle))[0] = 0;
            ((unsigned char *)(&profileAttrTblOneEntry->handle))[1] = 0;
            unsigned char *charValuePtr = (unsigned char *)characteristic->_value;
            memcpy(&profileAttrTblOneEntry->pValue, &charValuePtr, sizeof(uint8_t *));
            // {
            // {ATT_BT_UUID_SIZE, simpleProfilechar1UUID},
            // GATT_PERMIT_READ | GATT_PERMIT_WRITE,
            // 0,
            // simpleProfileChar1},

            //get the fast lut for characteristic callback
            profileAttrTableFastLut[profileAttrTableFastLutIndex].profileAttrPtr = profileAttrTblOneEntry;
            profileAttrTableFastLut[profileAttrTableFastLutIndex].profileAttrValueLen = characteristic->valueLength();
            profileAttrTableFastLutIndex++;

            profileAttrTblIndex++;

            if (characteristic->properties() & BLENotify) {
                //using error to print sizeof(NotificationConfigEntry)
                NotificationConfigEntry *notificationConfigEntry = &notificationConfigTable[notificationConfigTableIndex];
                notificationConfigEntry->valueProfileAttrIndex = profileAttrTblIndex - 1;   //previous one is characteristic value
                notificationConfigEntry->characteristicPtr = characteristic;

                //add config for notify
                //     {ATT_BT_UUID_SIZE, clientCharCfgUUID},
                //     GATT_PERMIT_READ | GATT_PERMIT_WRITE,
                //     0,
                //     (uint8_t *)simpleProfileChar4Config},

                profileAttrTblOneEntry = &profileAttrTbl[profileAttrTblIndex];

                profileAttrTblOneEntry->type.len = ATT_BT_UUID_SIZE;
                uint8_t *clientCharCfgUUIDPtr = (uint8_t *)clientCharCfgUUID;
                memcpy(&profileAttrTblOneEntry->type.uuid, &clientCharCfgUUIDPtr, sizeof(const uint8_t *));
                profileAttrTblOneEntry->permissions = GATT_PERMIT_READ | GATT_PERMIT_WRITE;
                ((unsigned char *)(&profileAttrTblOneEntry->handle))[0] = 0;
                ((unsigned char *)(&profileAttrTblOneEntry->handle))[1] = 0;
                gattCharCfg_t *charConfigPtr = (gattCharCfg_t *)notificationConfigEntry->charConfig;
                memcpy(&profileAttrTblOneEntry->pValue, &charConfigPtr, sizeof(uint8_t *));

                notificationConfigTableIndex++;
                profileAttrTblIndex++;

                // Initialize Client Characteristic Configuration attributes
                GATTServApp_InitCharCfg( INVALID_CONNHANDLE, charConfigPtr );
            }

        }
        if (localAttribute->type() == BLETypeService) {
            unsigned char *serviceUUID = (unsigned char *)uuidTableWritePtr;
            memcpy(serviceUUID, uuid.data(), uuid.length());
            uuidTableWritePtr += (uuid.length()+3)&0xFC; // Upround to 4 bytes
            gattAttrType_t *seriveAttr = (gattAttrType_t *)uuidTableWritePtr;
            seriveAttr->len = uuid.length();
            //avoid alignment issue, the compiler tried to use sw that does not work with misaligned address, if assign directly
            memcpy(&seriveAttr->uuid, &serviceUUID, sizeof(unsigned char *));
            uuidTableWritePtr += (sizeof(gattAttrType_t)+3)&0xFC;

            gattAttribute_t *profileAttrTblOneEntry = &profileAttrTbl[profileAttrTblIndex];

            profileAttrTblOneEntry->type.len = ATT_BT_UUID_SIZE;
            uint8_t *primaryServiceUUIDPtr = (uint8_t *)primaryServiceUUID;
            memcpy(&profileAttrTblOneEntry->type.uuid, &primaryServiceUUIDPtr, sizeof(const uint8_t *));
            profileAttrTblOneEntry->permissions = GATT_PERMIT_READ;
            ((unsigned char *)(&profileAttrTblOneEntry->handle))[0] = 0;
            ((unsigned char *)(&profileAttrTblOneEntry->handle))[1] = 0;
            memcpy(&profileAttrTblOneEntry->pValue, &seriveAttr, sizeof(uint8_t *));
            // profileAttrTbl[profileAttrTblIndex] = {
            //     {ATT_BT_UUID_SIZE, primaryServiceUUID}, /* type */
            //     GATT_PERMIT_READ,                       /* permissions */
            //     0,                                      /* handle */
            //     (uint8_t *)&seriveAttr        /* pValue */
            // };
            profileAttrTblIndex++;
        }
        if (localAttribute->type() == BLETypeDescriptor) {
            BLEDescriptor* descriptor = (BLEDescriptor*)localAttribute;
            gattAttribute_t *profileAttrTblOneEntry = &profileAttrTbl[profileAttrTblIndex];

            profileAttrTblOneEntry->type.len = ATT_BT_UUID_SIZE;
            uint8_t *charUserDescUUIDPtr = (uint8_t *)charUserDescUUID;
            memcpy(&profileAttrTblOneEntry->type.uuid, &charUserDescUUIDPtr, sizeof(const uint8_t *));
            profileAttrTblOneEntry->permissions = GATT_PERMIT_READ;
            ((unsigned char *)(&profileAttrTblOneEntry->handle))[0] = 0;
            ((unsigned char *)(&profileAttrTblOneEntry->handle))[1] = 0;
            char *descriptorValue = (char *)descriptor->value();
            memcpy(&profileAttrTblOneEntry->pValue, &descriptorValue, descriptor->valueLength());
            //     {ATT_BT_UUID_SIZE, charUserDescUUID},
            //     GATT_PERMIT_READ,
            //     0,
            //     simpleProfileChar1UserDesp},

            profileAttrTblIndex++;
        }
    }

    // Register with Link DB to receive link status change callback
    linkDB_Register(ch573BleTmosProfile_HandleConnStatusCB);

    uint8 status = SUCCESS;

    // Register GATT attribute list and CBs with GATT Server App
    status = GATTServApp_RegisterService( profileAttrTbl, profileAttrTblLength,
                                        GATT_MAX_ENCRYPT_KEY_SIZE,
                                        &ch573BleTmosProfileCBs );

    // //return ( status );





    // Set the GAP Characteristics
    GGS_SetParameter(GGS_DEVICE_NAME_ATT, GAP_DEVICE_NAME_LEN, attDeviceName);

    // Initialize the peripheral
    Peripheral_Init();



//   for (int i = 0; i < numLocalAttributes; i++) {
//     BLELocalAttribute *localAttribute = localAttributes[i];

