DeqingSun/arduino_core_ch32/libraries/CH573BlePeripheral/src/CH573BleTmos.cpp
//     if (localAttribute->type() == BLETypeCharacteristic) {
//       this->_numLocalCharacteristics++;
//     }
//   }

//   this->_numLocalCharacteristics -= 3; // 0x2a00, 0x2a01, 0x2a05

//   this->_localCharacteristicInfo = (struct localCharacteristicInfo*)malloc(sizeof(struct localCharacteristicInfo) * this->_numLocalCharacteristics);

//   unsigned char localCharacteristicIndex = 0;

//   uint16_t handle = 0;
//   BLEService *lastService = NULL;

//   for (int i = 0; i < numLocalAttributes; i++) {
//     BLELocalAttribute *localAttribute = localAttributes[i];
//     BLEUuid uuid = BLEUuid(localAttribute->uuid());
//     const unsigned char* uuidData = uuid.data();
//     unsigned char value[255];

//     ble_uuid_t nordicUUID;

//     if (uuid.length() == 2) {
//       nordicUUID.uuid = (uuidData[1] << 8) | uuidData[0];
//       nordicUUID.type = BLE_UUID_TYPE_BLE;
//     } else {
//       unsigned char uuidDataTemp[16];

//       memcpy(&uuidDataTemp, uuidData, sizeof(uuidDataTemp));

//       nordicUUID.uuid = (uuidData[13] << 8) | uuidData[12];

//       uuidDataTemp[13] = 0;
//       uuidDataTemp[12] = 0;

//       sd_ble_uuid_vs_add((ble_uuid128_t*)&uuidDataTemp, &nordicUUID.type);
//     }

//     if (localAttribute->type() == BLETypeService) {
//       BLEService *service = (BLEService *)localAttribute;

//       if (strcmp(service->uuid(), "1800") == 0 || strcmp(service->uuid(), "1801") == 0) {
//         continue; // skip
//       }

//       sd_ble_gatts_service_add(BLE_GATTS_SRVC_TYPE_PRIMARY, &nordicUUID, &handle);

//       lastService = service;
//     } else if (localAttribute->type() == BLETypeCharacteristic) {
//       BLECharacteristic *characteristic = (BLECharacteristic *)localAttribute;

//       if (strcmp(characteristic->uuid(), "2a00") == 0) {
//         ble_gap_conn_sec_mode_t secMode;
//         BLE_GAP_CONN_SEC_MODE_SET_OPEN(&secMode); // no security is needed

//         sd_ble_gap_device_name_set(&secMode, characteristic->value(), characteristic->valueLength());
//       } else if (strcmp(characteristic->uuid(), "2a01") == 0) {
//         const uint16_t *appearance = (const uint16_t*)characteristic->value();

//         sd_ble_gap_appearance_set(*appearance);
//       } else if (strcmp(characteristic->uuid(), "2a05") == 0) {
//         // do nothing
//       } else {
//         uint8_t properties = characteristic->properties() & 0xfe;
//         uint16_t valueLength = characteristic->valueLength();

//         this->_localCharacteristicInfo[localCharacteristicIndex].characteristic = characteristic;
//         this->_localCharacteristicInfo[localCharacteristicIndex].notifySubscribed = false;
//         this->_localCharacteristicInfo[localCharacteristicIndex].indicateSubscribed = false;
//         this->_localCharacteristicInfo[localCharacteristicIndex].service = lastService;

//         ble_gatts_char_md_t characteristicMetaData;
//         ble_gatts_attr_md_t clientCharacteristicConfigurationMetaData;
//         ble_gatts_attr_t    characteristicValueAttribute;
//         ble_gatts_attr_md_t characteristicValueAttributeMetaData;

//         memset(&characteristicMetaData, 0, sizeof(characteristicMetaData));

//         memcpy(&characteristicMetaData.char_props, &properties, 1);

//         characteristicMetaData.p_char_user_desc  = NULL;
//         characteristicMetaData.p_char_pf         = NULL;
//         characteristicMetaData.p_user_desc_md    = NULL;
//         characteristicMetaData.p_cccd_md         = NULL;
//         characteristicMetaData.p_sccd_md         = NULL;

//         if (properties & (BLENotify | BLEIndicate)) {
//           memset(&clientCharacteristicConfigurationMetaData, 0, sizeof(clientCharacteristicConfigurationMetaData));

//           BLE_GAP_CONN_SEC_MODE_SET_OPEN(&clientCharacteristicConfigurationMetaData.read_perm);
//           BLE_GAP_CONN_SEC_MODE_SET_OPEN(&clientCharacteristicConfigurationMetaData.write_perm);

//           clientCharacteristicConfigurationMetaData.vloc = BLE_GATTS_VLOC_STACK;

//           characteristicMetaData.p_cccd_md = &clientCharacteristicConfigurationMetaData;
//         }

//         memset(&characteristicValueAttributeMetaData, 0, sizeof(characteristicValueAttributeMetaData));

//         if (properties & (BLERead | BLENotify | BLEIndicate)) {
//           if (this->_bondStore) {
//             BLE_GAP_CONN_SEC_MODE_SET_ENC_NO_MITM(&characteristicValueAttributeMetaData.read_perm);
//           } else {
//             BLE_GAP_CONN_SEC_MODE_SET_OPEN(&characteristicValueAttributeMetaData.read_perm);
//           }
//         }

//         if (properties & (BLEWriteWithoutResponse | BLEWrite)) {
//           if (this->_bondStore) {
//             BLE_GAP_CONN_SEC_MODE_SET_ENC_NO_MITM(&characteristicValueAttributeMetaData.write_perm);
//           } else {
//             BLE_GAP_CONN_SEC_MODE_SET_OPEN(&characteristicValueAttributeMetaData.write_perm);
//           }
//         }

//         characteristicValueAttributeMetaData.vloc       = BLE_GATTS_VLOC_STACK;
//         characteristicValueAttributeMetaData.rd_auth    = 0;
//         characteristicValueAttributeMetaData.wr_auth    = 0;
//         characteristicValueAttributeMetaData.vlen       = !characteristic->fixedLength();

//         for (int j = (i + 1); j < numLocalAttributes; j++) {
//           localAttribute = localAttributes[j];

//           if (localAttribute->type() != BLETypeDescriptor) {
//             break;
//           }

//           BLEDescriptor *descriptor = (BLEDescriptor *)localAttribute;

//           if (strcmp(descriptor->uuid(), "2901") == 0) {
//             characteristicMetaData.p_char_user_desc        = (uint8_t*)descriptor->value();
//             characteristicMetaData.char_user_desc_max_size = descriptor->valueLength();
//             characteristicMetaData.char_user_desc_size     = descriptor->valueLength();
//           } else if (strcmp(descriptor->uuid(), "2904") == 0) {
//             characteristicMetaData.p_char_pf = (ble_gatts_char_pf_t *)descriptor->value();
//           }
//         }

//         memset(&characteristicValueAttribute, 0, sizeof(characteristicValueAttribute));

//         characteristicValueAttribute.p_uuid       = &nordicUUID;
//         characteristicValueAttribute.p_attr_md    = &characteristicValueAttributeMetaData;
//         characteristicValueAttribute.init_len     = valueLength;
//         characteristicValueAttribute.init_offs    = 0;
//         characteristicValueAttribute.max_len      = characteristic->valueSize();
//         characteristicValueAttribute.p_value      = NULL;

//         sd_ble_gatts_characteristic_add(BLE_GATT_HANDLE_INVALID, &characteristicMetaData, &characteristicValueAttribute, &this->_localCharacteristicInfo[localCharacteristicIndex].handles);

//         if (valueLength) {
//           for (int j = 0; j < valueLength; j++) {
//             value[j] = (*characteristic)[j];
//           }

