DeqingSun/arduino_core_ch32/libraries/CH573BlePeripheral/src/CH573BleTmos.cpp
//           sd_ble_gatts_value_set(this->_localCharacteristicInfo[localCharacteristicIndex].handles.value_handle, 0, &valueLength, value);
//         }

//         localCharacteristicIndex++;
//       }
//     } else if (localAttribute->type() == BLETypeDescriptor) {
//       BLEDescriptor *descriptor = (BLEDescriptor *)localAttribute;

//       if (strcmp(descriptor->uuid(), "2901") == 0 ||
//           strcmp(descriptor->uuid(), "2902") == 0 ||
//           strcmp(descriptor->uuid(), "2903") == 0 ||
//           strcmp(descriptor->uuid(), "2904") == 0) {
//         continue; // skip
//       }

//       uint16_t valueLength = descriptor->valueLength();

//       ble_gatts_attr_t descriptorAttribute;
//       ble_gatts_attr_md_t descriptorMetaData;

//       memset(&descriptorAttribute, 0, sizeof(descriptorAttribute));
//       memset(&descriptorMetaData, 0, sizeof(descriptorMetaData));

//       descriptorMetaData.vloc = BLE_GATTS_VLOC_STACK;
//       descriptorMetaData.vlen = (valueLength == descriptor->valueLength()) ? 0 : 1;

//       if (this->_bondStore) {
//         BLE_GAP_CONN_SEC_MODE_SET_ENC_NO_MITM(&descriptorMetaData.read_perm);
//       } else {
//         BLE_GAP_CONN_SEC_MODE_SET_OPEN(&descriptorMetaData.read_perm);
//       }

//       descriptorAttribute.p_uuid    = &nordicUUID;
//       descriptorAttribute.p_attr_md = &descriptorMetaData;
//       descriptorAttribute.init_len  = valueLength;
//       descriptorAttribute.max_len   = descriptor->valueLength();
//       descriptorAttribute.p_value   = NULL;

//       sd_ble_gatts_descriptor_add(BLE_GATT_HANDLE_INVALID, &descriptorAttribute, &handle);

//       if (valueLength) {
//         for (int j = 0; j < valueLength; j++) {
//           value[j] = (*descriptor)[j];
//         }

//         sd_ble_gatts_value_set(handle, 0, &valueLength, value);
//       }
//     }
//   }

//   if ( numRemoteAttributes > 0) {
//     numRemoteAttributes -= 2; // 0x1801, 0x2a05
//   }

//   for (int i = 0; i < numRemoteAttributes; i++) {
//     BLERemoteAttribute *remoteAttribute = remoteAttributes[i];

//     if (remoteAttribute->type() == BLETypeService) {
//       this->_numRemoteServices++;
//     } else if (remoteAttribute->type() == BLETypeCharacteristic) {
//       this->_numRemoteCharacteristics++;
//     }
//   }

//   this->_remoteServiceInfo = (struct remoteServiceInfo*)malloc(sizeof(struct remoteServiceInfo) * this->_numRemoteServices);
//   this->_remoteCharacteristicInfo = (struct remoteCharacteristicInfo*)malloc(sizeof(struct remoteCharacteristicInfo) * this->_numRemoteCharacteristics);

//   BLERemoteService *lastRemoteService = NULL;
//   unsigned char remoteServiceIndex = 0;
//   unsigned char remoteCharacteristicIndex = 0;

//   for (int i = 0; i < numRemoteAttributes; i++) {
//     BLERemoteAttribute *remoteAttribute = remoteAttributes[i];
//     BLEUuid uuid = BLEUuid(remoteAttribute->uuid());
//     const unsigned char* uuidData = uuid.data();

//     ble_uuid_t nordicUUID;

//     if (uuid.length() == 2) {
//       nordicUUID.uuid = (uuidData[1] << 8) | uuidData[0];
//       nordicUUID.type = BLE_UUID_TYPE_BLE;
//     } else {
//       unsigned char uuidDataTemp[16];

//       memcpy(&uuidDataTemp, uuidData, sizeof(uuidDataTemp));

//       nordicUUID.uuid = (uuidData[13] << 8) | uuidData[12];

//       uuidDataTemp[13] = 0;
//       uuidDataTemp[12] = 0;

//       sd_ble_uuid_vs_add((ble_uuid128_t*)&uuidDataTemp, &nordicUUID.type);
//     }

//     if (remoteAttribute->type() == BLETypeService) {
//       this->_remoteServiceInfo[remoteServiceIndex].service = lastRemoteService = (BLERemoteService *)remoteAttribute;
//       this->_remoteServiceInfo[remoteServiceIndex].uuid = nordicUUID;

//       memset(&this->_remoteServiceInfo[remoteServiceIndex].handlesRange, 0, sizeof(this->_remoteServiceInfo[remoteServiceIndex].handlesRange));

//       remoteServiceIndex++;
//     } else if (remoteAttribute->type() == BLETypeCharacteristic) {
//       this->_remoteCharacteristicInfo[remoteCharacteristicIndex].characteristic = (BLERemoteCharacteristic *)remoteAttribute;
//       this->_remoteCharacteristicInfo[remoteCharacteristicIndex].service = lastRemoteService;
//       this->_remoteCharacteristicInfo[remoteCharacteristicIndex].uuid = nordicUUID;

//       memset(&this->_remoteCharacteristicInfo[remoteCharacteristicIndex].properties, 0, sizeof(this->_remoteCharacteristicInfo[remoteCharacteristicIndex].properties));
//       this->_remoteCharacteristicInfo[remoteCharacteristicIndex].valueHandle = 0;

//       remoteCharacteristicIndex++;
//     }
//   }

//   if (this->_bondStore && this->_bondStore->hasData()) {
// #ifdef NRF_51822_DEBUG
//     Serial.println(F("Restoring bond data"));
// #endif
// #if defined(NRF5) || defined(NRF51_S130)
//     this->_bondStore->getData(this->_bondData, 0, sizeof(this->_bondData));
// #else
//     this->_bondStore->getData(this->_authStatusBuffer, 0, sizeof(this->_authStatusBuffer));
// #endif
//   }

//   this->startAdvertising();

// #ifdef __RFduino__
//   RFduinoBLE_enabled = 1;
// #endif
}

bool CH573BleTmos::updateCharacteristicValue(BLECharacteristic& characteristic) {
    bool success = true;

    if (characteristic.properties() & BLENotify) {
        for (int i=0;i<notificationConfigTableLength;i++){
            if (notificationConfigTable[i].characteristicPtr == &characteristic) {
                attHandleValueNoti_t noti;
                // if(len > (peripheralMTU - 3))    //todo: check it
                // {
                //     PRINT("Too large noti\n");
                //     return;
                // }
                noti.len = characteristic.valueLength();
                noti.pValue = (uint8_t *)GATT_bm_alloc(peripheralConnList.connHandle, ATT_HANDLE_VALUE_NOTI, noti.len, NULL, 0);
                bool needFree = true;
                if(noti.pValue)
                {
                    tmos_memcpy(noti.pValue, characteristic.value(), noti.len);
                    uint16_t value = GATTServApp_ReadCharCfg(peripheralConnList.connHandle, notificationConfigTable[i].charConfig);
                    if(value & GATT_CLIENT_CFG_NOTIFY)
                    {
                        noti.handle = profileAttrTbl[notificationConfigTable[i].valueProfileAttrIndex].handle;

                        // Send the notification
                        if (GATT_Notification(peripheralConnList.connHandle, &noti, FALSE) == SUCCESS)
                        {
                            needFree = false;
                        }
                    }
                }
                if(needFree){
                    GATT_bm_free((gattMsg_t *)&noti, ATT_HANDLE_VALUE_NOTI);
                }


            }
        }
    }

  return success;

}

void CH573BleTmos::bleConnectedCallback(gapEstLinkReqEvent_t *pEvent) {
    if (this->_eventListener) {
        asm("nop");
        asm("nop");
        asm("nop");
        asm("nop");
        asm("nop");
        asm("nop");
        asm("nop");
        asm("nop");
        asm("nop");
        this->_eventListener->BLEDeviceConnected(*this, pEvent->devAddr);
    }
}

void CH573BleTmos::bleDisconnectedCallback(gapTerminateLinkEvent_t *pEvent) {
    // if (this->_eventListener) {
    //     this->_eventListener->BLEDeviceDisconnected(*this);
    // }
}
